### Importar Librerias 

pandas
numpy
seaborn
matplotlib

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

### Lectura de archivo CSV

In [5]:

df= pd.read_csv("Dataset/CreditRisk.csv")

# Para seleccionar los encabezados 
df.head()

,status,seniority,home,time,age,marital,records,job,expenses,income,assets,debt,amount,price
0,ok,9,rent,60,30,married,no,freelance,73,129,0,0,800,846
1,ok,17,rent,60,58,widow,no,fixed,48,131,0,0,1000,1658
2,default,10,owner,36,46,married,yes,freelance,90,200,3000,0,2000,2985
3,ok,0,rent,60,24,single,no,fixed,63,182,2500,0,900,1325
4,ok,0,rent,36,26,single,no,fixed,46,107,0,0,310,910

### Visualizar los tipos de datos de nuestra base

In [6]:
df.dtypes

status       object
seniority     int64
home         object
time          int64
age           int64
marital      object
records      object
job          object
expenses      int64
income        int64
assets        int64
debt          int64
amount        int64
price         int64
dtype: object

In [7]:
df.count

<bound method DataFrame.count of        status  seniority   home  time  age  marital records        job  \
0          ok          9   rent    60   30  married      no  freelance
1          ok         17   rent    60   58    widow      no      fixed
2     default         10  owner    36   46  married     yes  freelance
3          ok          0   rent    60   24   single      no      fixed
4          ok          0   rent    36   26   single      no      fixed
...       ...        ...    ...   ...  ...      ...     ...        ...
4450  default          1   rent    60   39  married      no      fixed
4451       ok         22  owner    60   46  married      no      fixed
4452  default          0  owner    24   37  married      no    partime
4453       ok          0   rent    48   23   single      no  freelance
4454       ok          5  owner    60   32  married      no  freelance

      expenses  income  assets  debt  amount  price
0           73     129       0     0     800    846
1           48     131       0     0    1000   1658
2           90     200    3000     0    2000   2985
3           63     182    2500     0     900   1325
4           46     107       0     0     310    910
...        ...     ...     ...   ...     ...    ...
4450        69      92       0     0     900   1020
4451        60      75    3000   600     950   1263
4452        60      90    3500     0     500    963
4453        49     140       0     0     550    550
4454        60     140    4000  1000    1350   1650

[4455 rows x 14 columns]>

In [14]:
df.describe().round()

,seniority,time,age,expenses,income,assets,debt,amount,price
count,4455.0,4455.0,4455.0,4455.0,4455.0,4455.0,4455.0,4455.0,4455.0
mean,8.0,46.0,37.0,56.0,763317.0,1060341.0,404382.0,1039.0,1463.0
std,8.0,15.0,11.0,20.0,8703625.0,10217569.0,6344253.0,475.0,628.0
min,0.0,6.0,18.0,35.0,0.0,0.0,0.0,100.0,105.0
25%,2.0,36.0,28.0,35.0,80.0,0.0,0.0,700.0,1118.0
50%,5.0,48.0,36.0,51.0,120.0,3500.0,0.0,1000.0,1400.0
75%,12.0,60.0,45.0,72.0,166.0,6000.0,0.0,1300.0,1692.0
max,48.0,72.0,68.0,180.0,99999999.0,99999999.0,99999999.0,5000.0,11140.0